import { Constellation } from '../types'

export const ara: Constellation = {
  name: 'Ara',
  meaning: 'the Altar',
  aster: [
    // α Arae to β Arae:
    {
      moveTo: {
        ra: 262.9605,
        dec: -49.8759722222
      },
      lineTo: {
        ra: 261.325,
        dec: -55.5298333333
      }
    },
    // β Arae to Tarazed:
    {
      moveTo: {
        ra: 261.325,
        dec: -55.5298333333
      },
      lineTo: {
        ra: 261.3485833333,
        dec: -56.3776944444
      }
    },
    // γ Arae to δ Arae:
    {
      moveTo: {
        ra: 261.3485833333,
        dec: -56.3776944444
      },
      lineTo: {
        ra: 262.7749166667,
        dec: -60.6836111111
      }
    },
    // δ Arae to η Arae:
    {
      moveTo: {
        ra: 262.7749166667,
        dec: -60.6836111111
      },
      lineTo: {
        ra: 252.4462916667,
        dec: -59.0413055556
      }
    },
    // η Arae to ζ Arae:
    {
      moveTo: {
        ra: 252.4462916667,
        dec: -59.0413055556
      },
      lineTo: {
        ra: 254.655125,
        dec: -55.9900555556
      }
    },
    // ζ Arae to ε¹ Arae:
    {
      moveTo: {
        ra: 254.655125,
        dec: -55.9900555556
      },
      lineTo: {
        ra: 254.8960416667,
        dec: -53.1605
      }
    },
    // ε¹ Arae to α Arae
    {
      moveTo: {
        ra: 254.8960416667,
        dec: -53.1605
      },
      lineTo: {
        ra: 262.9605,
        dec: -49.8759722222
      }
    }
  ],
  boundaries: [
    {
      ra: 249.034681,
      dec: -60.264458
    },
    {
      ra: 248.570624,
      dec: -45.767052
    },
    {
      ra: 269.809284,
      dec: -45.516346
    },
    {
      ra: 272.309017,
      dec: -45.485973
    },
    {
      ra: 272.672253,
      dec: -56.983772
    },
    {
      ra: 265.16819,
      dec: -57.074776
    },
    {
      ra: 265.775729,
      dec: -67.571106
    },
    {
      ra: 258.242482,
      dec: -67.661087
    },
    {
      ra: 255.724983,
      dec: -67.690582
    },
    {
      ra: 255.542393,
      dec: -65.191643
    },
    {
      ra: 254.283515,
      dec: -65.206253
    },
    {
      ra: 254.195137,
      dec: -63.790093
    },
    {
      ra: 251.676321,
      dec: -63.818996
    },
    {
      ra: 251.537847,
      dec: -61.236458
    },
    {
      ra: 249.08163,
      dec: -61.264195
    },
    {
      ra: 249.034681,
      dec: -60.264458
    }
  ]
}
