import { Constellation } from '../types'

export const cepheus: Constellation = {
  name: 'Cepheus',
  meaning: '	Cepheus (a king of Aethiopia, mythological character)',
  aster: [
    // Errai to Alfirk:
    {
      moveTo: {
        ra: 354.836655,
        dec: 77.632313
      },
      lineTo: {
        ra: 322.164987,
        dec: 70.560715
      }
    },
    // Errai to ι Cephei:
    {
      moveTo: {
        ra: 354.836655,
        dec: 77.632313
      },
      lineTo: {
        ra: 342.4204583333,
        dec: 66.2007222222
      }
    },
    // Alfirk to ι Cephei:
    {
      moveTo: {
        ra: 322.164987,
        dec: 70.560715
      },
      lineTo: {
        ra: 342.4204583333,
        dec: 66.2007222222
      }
    },
    // ι Cephei to δ Cephei:
    {
      moveTo: {
        ra: 342.4204583333,
        dec: 66.2007222222
      },
      lineTo: {
        ra: 337.2927083333,
        dec: 58.4151944444
      }
    },
    // δ Cephei to ε Cephei:
    {
      moveTo: {
        ra: 337.2927083333,
        dec: 58.4151944444
      },
      lineTo: {
        ra: 333.757,
        dec: 57.0434722222
      }
    },
    // ε Cephei to μ Cephei:
    {
      moveTo: {
        ra: 333.757,
        dec: 57.0434722222
      },
      lineTo: {
        ra: 325.876875,
        dec: 58.7800555556
      }
    },
    // μ Cephei to Alderamin:
    {
      moveTo: {
        ra: 325.876875,
        dec: 58.7800555556
      },
      lineTo: {
        ra: 319.644885,
        dec: 62.585574
      }
    },
    // Alfirk to Alderamin:
    {
      moveTo: {
        ra: 322.164987,
        dec: 70.560715
      },
      lineTo: {
        ra: 319.644885,
        dec: 62.585574
      }
    },
    // Alderamin to η Cephei:
    {
      moveTo: {
        ra: 319.644885,
        dec: 62.585574
      },
      lineTo: {
        ra: 311.3219583333,
        dec: 61.8368055556
      }
    },
    // η Cephei to θ Cephei:
    {
      moveTo: {
        ra: 311.3219583333,
        dec: 61.8368055556
      },
      lineTo: {
        ra: 307.395125,
        dec: 62.9941388889
      }
    }
  ],
  boundaries: [
    {
      ra: 300.573263,
      dec: 59.851078
    },
    {
      ra: 300.4852,
      dec: 61.85062
    },
    {
      ra: 306.811868,
      dec: 61.914379
    },
    {
      ra: 306.517381,
      dec: 67.412956
    },
    {
      ra: 310.334015,
      dec: 67.449028
    },
    {
      ra: 309.57304,
      dec: 75.445526
    },
    {
      ra: 301.873398,
      dec: 75.370873
    },
    {
      ra: 300.6738,
      dec: 80.364777
    },
    {
      ra: 313.705874,
      dec: 80.486786
    },
    {
      ra: 308.72097,
      dec: 86.465622
    },
    {
      ra: 308.331355,
      dec: 86.63063
    },
    {
      ra: 343.510666,
      dec: 86.836891
    },
    {
      ra: 339.260988,
      dec: 88.663887
    },
    {
      ra: 135.832471,
      dec: 87.568916
    },
    {
      ra: 130.40275,
      dec: 86.097542
    },
    {
      ra: 127.953615,
      dec: 84.610375
    },
    {
      ra: 84.536118,
      dec: 85.123947
    },
    {
      ra: 80.488895,
      dec: 80.14785
    },
    {
      ra: 57.53049,
      dec: 80.398666
    },
    {
      ra: 56.72621,
      dec: 77.402596
    },
    {
      ra: 55.308749,
      dec: 77.416313
    },
    {
      ra: 6.922914,
      dec: 77.692345
    },
    {
      ra: 6.763764,
      dec: 66.692444
    },
    {
      ra: 355.19786,
      dec: 66.692871
    },
    {
      ra: 355.217571,
      dec: 63.692879
    },
    {
      ra: 348.81649,
      dec: 63.68129
    },
    {
      ra: 348.859664,
      dec: 59.764675
    },
    {
      ra: 344.269124,
      dec: 59.751232
    },
    {
      ra: 344.304027,
      dec: 56.917961
    },
    {
      ra: 335.91093,
      dec: 56.882576
    },
    {
      ra: 335.931301,
      dec: 55.632626
    },
    {
      ra: 333.137626,
      dec: 55.617844
    },
    {
      ra: 333.174676,
      dec: 53.367943
    },
    {
      ra: 330.63921,
      dec: 53.353271
    },
    {
      ra: 330.602189,
      dec: 55.436489
    },
    {
      ra: 309.831361,
      dec: 55.275326
    },
    {
      ra: 309.623795,
      dec: 61.357697
    },
    {
      ra: 308.660804,
      dec: 61.348644
    },
    {
      ra: 308.716593,
      dec: 59.93224
    },
    {
      ra: 300.573263,
      dec: 59.851078
    }
  ]
}
