import { Constellation } from '../types'

export const cygnus: Constellation = {
  name: 'Cygnus',
  meaning: 'the swan',
  aster: [
    // Deneb to Sadr:
    {
      moveTo: {
        ra: 310.35798,
        dec: 45.280339
      },
      lineTo: {
        ra: 305.557091,
        dec: 40.256679
      }
    },
    // Sadr to η Cygni:
    {
      moveTo: {
        ra: 305.557091,
        dec: 40.256679
      },
      lineTo: {
        ra: 299.0766666667,
        dec: 35.0835
      }
    },
    // η Cygni to Albireo:
    {
      moveTo: {
        ra: 299.0766666667,
        dec: 35.0835
      },
      lineTo: {
        ra: 292.680351,
        dec: 27.959692
      }
    },
    // Sadr to Fawaris:
    {
      moveTo: {
        ra: 305.557091,
        dec: 40.256679
      },
      lineTo: {
        ra: 296.243658,
        dec: 45.13081
      }
    },
    // Fawaris to ι Cygni:
    {
      moveTo: {
        ra: 296.243658,
        dec: 45.13081
      },
      lineTo: {
        ra: 292.4264166667,
        dec: 51.7294722222
      }
    },
    // ι Cygni to κ Cygni:
    {
      moveTo: {
        ra: 292.4264166667,
        dec: 51.7294722222
      },
      lineTo: {
        ra: 289.2754583333,
        dec: 53.3681666667
      }
    },
    // Sadr to Aljanah:
    {
      moveTo: {
        ra: 305.557091,
        dec: 40.256679
      },
      lineTo: {
        ra: 311.552843,
        dec: 33.970257
      }
    },
    // Aljanah to ζ Cygni:
    {
      moveTo: {
        ra: 311.552843,
        dec: 33.970257
      },
      lineTo: {
        ra: 318.2340833333,
        dec: 30.2270833333
      }
    },
    // ζ Cygni to μ¹ Cygni:
    {
      moveTo: {
        ra: 318.2340833333,
        dec: 30.2270833333
      },
      lineTo: {
        ra: 326.035,
        dec: 28.7432222222
      }
    },
    // Deneb to ν Cygni:
    {
      moveTo: {
        ra: 310.35798,
        dec: 45.280339
      },
      lineTo: {
        ra: 314.293375,
        dec: 41.1671944444
      }
    },
    // ν Cygni to ζ Cygni:
    {
      moveTo: {
        ra: 314.293375,
        dec: 41.1671944444
      },
      lineTo: {
        ra: 318.2340833333,
        dec: 30.2270833333
      }
    },
    // Deneb to ο² Cygni:
    {
      moveTo: {
        ra: 310.35798,
        dec: 45.280339
      },
      lineTo: {
        ra: 303.868,
        dec: 47.7141944444
      }
    },
    // ο² Cygni to ι Cygni:
    {
      moveTo: {
        ra: 303.868,
        dec: 47.7141944444
      },
      lineTo: {
        ra: 292.4264166667,
        dec: 51.7294722222
      }
    }
  ],
  boundaries: [
    {
      ra: 290.132646,
      dec: 27.732408
    },
    {
      ra: 290.095253,
      dec: 30.232197
    },
    {
      ra: 291.598778,
      dec: 30.249315
    },
    {
      ra: 291.492605,
      dec: 36.748714
    },
    {
      ra: 292.119655,
      dec: 36.755802
    },
    {
      ra: 291.983527,
      dec: 43.755035
    },
    {
      ra: 288.470307,
      dec: 43.714939
    },
    {
      ra: 288.37552,
      dec: 47.714394
    },
    {
      ra: 287.120648,
      dec: 47.699867
    },
    {
      ra: 286.87646,
      dec: 55.698448
    },
    {
      ra: 291.904593,
      dec: 55.756004
    },
    {
      ra: 291.80955,
      dec: 58.25547
    },
    {
      ra: 297.100554,
      dec: 58.313873
    },
    {
      ra: 297.039241,
      dec: 59.813541
    },
    {
      ra: 300.573263,
      dec: 59.851078
    },
    {
      ra: 308.716593,
      dec: 59.93224
    },
    {
      ra: 308.660804,
      dec: 61.348644
    },
    {
      ra: 309.623795,
      dec: 61.357697
    },
    {
      ra: 309.831361,
      dec: 55.275326
    },
    {
      ra: 330.602189,
      dec: 55.436489
    },
    {
      ra: 330.63921,
      dec: 53.353271
    },
    {
      ra: 330.762663,
      dec: 44.603645
    },
    {
      ra: 329.878606,
      dec: 44.598251
    },
    {
      ra: 329.88164,
      dec: 44.348263
    },
    {
      ra: 329.37664,
      dec: 44.34512
    },
    {
      ra: 329.461012,
      dec: 36.595383
    },
    {
      ra: 327.319965,
      dec: 36.581547
    },
    {
      ra: 327.395181,
      dec: 28.581795
    },
    {
      ra: 322.620164,
      dec: 28.548054
    },
    {
      ra: 315.083915,
      dec: 28.487188
    },
    {
      ra: 315.072584,
      dec: 29.487139
    },
    {
      ra: 296.250944,
      dec: 29.301058
    },
    {
      ra: 296.272201,
      dec: 27.801174
    },
    {
      ra: 290.132646,
      dec: 27.732408
    }
  ]
}
