import { Constellation } from '../types'

export const hydra: Constellation = {
  name: 'Hydra',
  meaning: 'Hydra (mythological creature)',
  aster: [
    // E Hydrae to π Hydrae:
    {
      moveTo: {
        ra: 222.5727916667,
        dec: -27.9602222222
      },
      lineTo: {
        ra: 211.5927916667,
        dec: -26.6820277778
      }
    },
    // π Hydrae to γ Hydrae:
    {
      moveTo: {
        ra: 211.5927916667,
        dec: -26.6820277778
      },
      lineTo: {
        ra: 199.7302083333,
        dec: -23.1714166667
      }
    },
    // γ Hydrae to β Hydrae:
    {
      moveTo: {
        ra: 199.7302083333,
        dec: -23.1714166667
      },
      lineTo: {
        ra: 178.2273333333,
        dec: -33.9081388889
      }
    },
    // β Hydrae to ξ Hydrae:
    {
      moveTo: {
        ra: 178.2273333333,
        dec: -33.9081388889
      },
      lineTo: {
        ra: 173.2510833333,
        dec: -31.8575277778
      }
    },
    // ξ Hydrae to β Crateris:
    {
      moveTo: {
        ra: 173.2510833333,
        dec: -31.8575277778
      },
      lineTo: {
        ra: 167.9145416667,
        dec: -22.8256111111
      }
    },
    // β Crateris to Alkes:
    {
      moveTo: {
        ra: 167.9145416667,
        dec: -22.8256111111
      },
      lineTo: {
        ra: 164.943604,
        dec: -18.298783
      }
    },
    // Alkes to ν Hydrae:
    {
      moveTo: {
        ra: 164.943604,
        dec: -18.298783
      },
      lineTo: {
        ra: 162.4059583333,
        dec: -16.1941388889
      }
    },
    // ν Hydrae to μ Hydrae:
    {
      moveTo: {
        ra: 162.4059583333,
        dec: -16.1941388889
      },
      lineTo: {
        ra: 156.5229583333,
        dec: -16.8360833333
      }
    },
    // μ Hydrae to λ Hydrae:
    {
      moveTo: {
        ra: 156.5229583333,
        dec: -16.8360833333
      },
      lineTo: {
        ra: 152.6475,
        dec: -12.3538333333
      }
    },
    // λ Hydrae to υ¹ Hydrae:
    {
      moveTo: {
        ra: 152.6475,
        dec: -12.3538333333
      },
      lineTo: {
        ra: 147.869558,
        dec: -14.846603
      }
    },
    // υ¹ Hydrae to Alphard:
    {
      moveTo: {
        ra: 147.869558,
        dec: -14.846603
      },
      lineTo: {
        ra: 141.896847,
        dec: -8.658602
      }
    },
    // Alphard to Ukdah:
    {
      moveTo: {
        ra: 141.896847,
        dec: -8.658602
      },
      lineTo: {
        ra: 144.964008,
        dec: -1.14281
      }
    },
    // Ukdah to θ Hydrae:
    {
      moveTo: {
        ra: 144.964008,
        dec: -1.14281
      },
      lineTo: {
        ra: 138.5907916667,
        dec: 2.3150277778
      }
    },
    // θ Hydrae to ζ Hydrae:
    {
      moveTo: {
        ra: 138.5907916667,
        dec: 2.3150277778
      },
      lineTo: {
        ra: 133.8486666667,
        dec: 5.9455277778
      }
    },
    // ζ Hydrae to Ashlesha:
    {
      moveTo: {
        ra: 133.8486666667,
        dec: 5.9455277778
      },
      lineTo: {
        ra: 131.693794,
        dec: 6.418809
      }
    },
    // Ashlesha to δ Hydrae:
    {
      moveTo: {
        ra: 131.693794,
        dec: 6.418809
      },
      lineTo: {
        ra: 129.4142083333,
        dec: 5.7038055556
      }
    },
    // δ Hydrae to Minchir:
    {
      moveTo: {
        ra: 129.4142083333,
        dec: 5.7038055556
      },
      lineTo: {
        ra: 129.689323,
        dec: 3.341436
      }
    },
    // Minchir to η Hydrae:
    {
      moveTo: {
        ra: 129.689323,
        dec: 3.341436
      },
      lineTo: {
        ra: 130.8062083333,
        dec: 3.3986666667
      }
    },
    // η Hydrae to ρ Hydrae:
    {
      moveTo: {
        ra: 130.8062083333,
        dec: 3.3986666667
      },
      lineTo: {
        ra: 132.10825,
        dec: 5.8378888889
      }
    }
  ],
  boundaries: [
    {
      ra: 122.849007,
      dec: -0.36939
    },
    {
      ra: 122.921391,
      dec: 6.630238
    },
    {
      ra: 140.404259,
      dec: 6.470069
    },
    {
      ra: 145.398417,
      dec: 6.432767
    },
    {
      ra: 145.348906,
      dec: -0.567059
    },
    {
      ra: 145.270272,
      dec: -11.566781
    },
    {
      ra: 162.807914,
      dec: -11.662143
    },
    {
      ra: 162.77554,
      dec: -19.662083
    },
    {
      ra: 164.030586,
      dec: -19.666622
    },
    {
      ra: 164.008083,
      dec: -25.166582
    },
    {
      ra: 179.09131,
      dec: -25.195795
    },
    {
      ra: 190.404525,
      dec: -25.186401
    },
    {
      ra: 190.398503,
      dec: -22.686409
    },
    {
      ra: 194.16687,
      dec: -22.677342
    },
    {
      ra: 215.513091,
      dec: -22.572775
    },
    {
      ra: 215.53369,
      dec: -25.072702
    },
    {
      ra: 225.576554,
      dec: -24.99511
    },
    {
      ra: 225.63077,
      dec: -29.994879
    },
    {
      ra: 190.4174,
      dec: -30.18639
    },
    {
      ra: 190.427199,
      dec: -33.686378
    },
    {
      ra: 185.387435,
      dec: -33.693893
    },
    {
      ra: 185.390296,
      dec: -35.69389
    },
    {
      ra: 166.479363,
      dec: -35.674656
    },
    {
      ra: 163.958515,
      dec: -35.666496
    },
    {
      ra: 163.977885,
      dec: -31.833201
    },
    {
      ra: 160.201379,
      dec: -31.818586
    },
    {
      ra: 160.212894,
      dec: -29.818613
    },
    {
      ra: 155.181327,
      dec: -29.794784
    },
    {
      ra: 155.199338,
      dec: -27.128162
    },
    {
      ra: 147.659283,
      dec: -27.083504
    },
    {
      ra: 147.679681,
      dec: -24.583571
    },
    {
      ra: 141.904335,
      dec: -24.542519
    },
    {
      ra: 137.636776,
      dec: -24.508631
    },
    {
      ra: 137.68497,
      dec: -19.508831
    },
    {
      ra: 130.163512,
      dec: -19.442373
    },
    {
      ra: 130.18434,
      dec: -17.442471
    },
    {
      ra: 126.927095,
      dec: -17.411257
    },
    {
      ra: 126.98978,
      dec: -11.411565
    },
    {
      ra: 122.734179,
      dec: -11.368799
    },
    {
      ra: 122.849007,
      dec: -0.36939
    }
  ]
}
