import { Constellation } from '../types'

export const lupus: Constellation = {
  name: 'Lupus',
  meaning: 'the wolf',
  aster: [
    // α Lupi to ζ Lupi:
    {
      moveTo: {
        ra: 220.482375,
        dec: -47.3881388889
      },
      lineTo: {
        ra: 228.0716666667,
        dec: -52.0990833333
      }
    },
    // ζ Lupi to μ Lupi:
    {
      moveTo: {
        ra: 228.0716666667,
        dec: -52.0990833333
      },
      lineTo: {
        ra: 229.6335416667,
        dec: -47.8751944444
      }
    },
    // ζ Lupi to η Lupi:
    {
      moveTo: {
        ra: 228.0716666667,
        dec: -52.0990833333
      },
      lineTo: {
        ra: 240.0305833333,
        dec: -38.3966388889
      }
    },
    // μ Lupi to ε Lupi:
    {
      moveTo: {
        ra: 229.6335416667,
        dec: -47.8751944444
      },
      lineTo: {
        ra: 230.670375,
        dec: -44.6895833333
      }
    },
    // ε Lupi to γ Lupi:
    {
      moveTo: {
        ra: 230.670375,
        dec: -44.6895833333
      },
      lineTo: {
        ra: 233.78525,
        dec: -41.1666944444
      }
    },
    // γ Lupi to η Lupi:
    {
      moveTo: {
        ra: 233.78525,
        dec: -41.1666944444
      },
      lineTo: {
        ra: 240.0305833333,
        dec: -38.3966388889
      }
    },
    // η Lupi to χ Lupi:
    {
      moveTo: {
        ra: 240.0305833333,
        dec: -38.3966388889
      },
      lineTo: {
        ra: 237.73975,
        dec: -33.6271111111
      }
    },
    // χ Lupi to φ¹ Lupi:
    {
      moveTo: {
        ra: 237.73975,
        dec: -33.6271111111
      },
      lineTo: {
        ra: 230.4518333333,
        dec: -36.2611666667
      }
    },
    // φ¹ Lupi to η Lupi:
    {
      moveTo: {
        ra: 230.4518333333,
        dec: -36.2611666667
      },
      lineTo: {
        ra: 240.0305833333,
        dec: -38.3966388889
      }
    },
    // γ Lupi to δ Lupi:
    {
      moveTo: {
        ra: 233.78525,
        dec: -41.1666944444
      },
      lineTo: {
        ra: 230.3430833333,
        dec: -40.6474722222
      }
    },
    // δ Lupi to β Lupi:
    {
      moveTo: {
        ra: 230.3430833333,
        dec: -40.6474722222
      },
      lineTo: {
        ra: 224.633125,
        dec: -43.1338611111
      }
    }
  ],
  boundaries: [
    {
      ra: 214.656816,
      dec: -55.579952
    },
    {
      ra: 220.234465,
      dec: -55.540089
    },
    {
      ra: 228.083511,
      dec: -55.475494
    },
    {
      ra: 228.056716,
      dec: -54.475617
    },
    {
      ra: 232.353372,
      dec: -54.436417
    },
    {
      ra: 232.207246,
      dec: -48.437107
    },
    {
      ra: 237.247281,
      dec: -48.388023
    },
    {
      ra: 237.124585,
      dec: -42.388638
    },
    {
      ra: 242.152806,
      dec: -42.336678
    },
    {
      ra: 241.947699,
      dec: -29.837763
    },
    {
      ra: 236.92998,
      dec: -29.889616
    },
    {
      ra: 225.63077,
      dec: -29.994879
    },
    {
      ra: 225.79628,
      dec: -42.494175
    },
    {
      ra: 214.450265,
      dec: -42.580647
    },
    {
      ra: 214.656816,
      dec: -55.579952
    }
  ]
}
